{
    "endpoint": "/aggregate/kmeans", 
    "type": "record", 
    "name": "aggregate_k_means_request", 
    "desc_name": "Aggregate K-means",
    "on_prem_only": false,
    "is_host_manager_endpoint": false,
    "is_single_table_oriented": true,
    "short_doc": "Run the k-means algorithm on a dataset",
    "doc": "This endpoint runs the k-means algorithm - a heuristic algorithm
that attempts to do k-means clustering.  An ideal k-means clustering algorithm
selects k points such that the sum of the mean squared distances of each member
of the set to the nearest of the k points is minimized.  The k-means algorithm
however does not necessarily produce such an ideal cluster.   It begins with a
randomly selected set of k points and then refines the location of the points
iteratively and settles to a local minimum.  Various parameters and options are
provided to control the heuristic search.

NOTE:  The Kinetica instance being accessed must be running a CUDA (GPU-based)
build to service this request.",
    "fields": [
        {
            "name": "table_name", 
            "type": "string", 
            "doc": "Name of the table on which the operation will be performed. Must be an existing table, in [schema_name.]table_name format, using standard {name resolution rules}@{link /concepts/tables/#table-name-resolution}.",
            "value":
            {
                "is_input_table_name": true
            }
        },
        {
            "name": "column_names", 
            "type": {
                "type" : "array",
                "items" : "string"
            }, 
            "doc": "List of column names on which the operation would be performed. If n columns are provided then each of the k result points will have n dimensions corresponding to the n columns.", 
            "value": {}
        },
        {
            "name": "k", 
            "type": "int", 
            "doc": "The number of mean points to be determined by the algorithm.", 
            "value": {}
        },
        {
            "name": "tolerance", 
            "type": "double", 
            "doc": "Stop iterating when the distances between successive points is less than the given tolerance.", 
            "value": {}
        },
        {
            "name": "options", 
            "type": 
            {
                "type" : "map",
                "values" : "string"
            }, 
            "doc": "Optional parameters.", 
            "value": 
            { 
                "default" : {},
                "valid_keys" :
                {
                    "whiten" :
                    {
                        "doc"  : "When set to 1 each of the columns is first normalized by its stdv - default is not to whiten.",
                        "value" : {}
                    },
                    "max_iters" :
                    {
                        "doc"  : "Number of times to try to hit the tolerance limit before giving up - default is 10.",
                        "value" : {}
                    },
                    "num_tries" :
                    {
                        "doc"  : "Number of times to run the k-means algorithm with a different randomly selected starting points - helps avoid local minimum. Default is 1.",
                        "value" : {}
                    }
                }

            }
        }
    ]
}
